print('Шляпка гриба, покрытая_ кожиц_й, держится на _ ножк_.Снизу шляпка затянута _ пленкой, Когда её уберешь,откроется нижняя _ сторона шляпк_')
a=   str(input('Введите недостающее слово: покрытая - '))
b = str(input('Введите недостающую букву: кожиц..й - '))
c = str(input('Введите недостающее слово: держится на -'))
d = str(input('Введите недостающую букву: ножк.. - '))
f = str(input('Введите недостающее слово: затянута - '))
g = str(input('Введите недостающее слово: откроется нижняя - '))
e = str(input('Введите недостающую букву: шляпк.. - '))

print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {c} ножк{d}.Снизу шляпка затянута {f} пленкой, Когда её уберешь,откроется нижняя {g} сторона шляпк{e}')


